src/main/resources/sampleRequests/GetInfoPayment.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pay="http://kyc-payments.com/PaymentTypes">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" wsse:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>LHPH</wsse:Username>
                <wsse:Password>qwerty</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <dev:DeviceData xmlns:dev="http://kyc-payments.com/HeaderTypes">
            <dev:device>MOBILE</dev:device>
        </dev:DeviceData>
    </soapenv:Header>
    <soapenv:Body>
        <pay:GetInfoPaymentRequest>
            <pay:folio>2</pay:folio>
        </pay:GetInfoPaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>