src/main/resources/sampleRequests/GetHistoricalPayments.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pay="http://kyc-payments.com/PaymentTypes" xmlns:com="http://kyc-payments.com/CommonTypes">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" wsse:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>LHPH</wsse:Username>
                <wsse:Password>qwerty</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <dev:DeviceData xmlns:dev="http://kyc-payments.com/HeaderTypes">
            <dev:device>MOBILE</dev:device>
        </dev:DeviceData>
    </soapenv:Header>
    <soapenv:Body>
        <pay:GetHistoricalPaymentsRequest>
            <pay:criteria>
                <com:startDate>2020-10-02</com:startDate>
                <com:finishDate>2020-12-20</com:finishDate>
                <com:numRecords>10</com:numRecords>
            </pay:criteria>
        </pay:GetHistoricalPaymentsRequest>
    </soapenv:Body>
</soapenv:Envelope>