src/main/resources/sampleRequests/MakePayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:pay="http://kyc-payments.com/PaymentTypes"
                  xmlns:com="http://kyc-payments.com/CommonTypes">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" wsse:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>admin</wsse:Username>
                <wsse:Password>pass</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <dev:DeviceData xmlns:dev="http://kyc-payments.com/HeaderTypes">
            <dev:device>MOBILE</dev:device>
        </dev:DeviceData>
    </soapenv:Header>
    <soapenv:Body>
        <pay:MakePaymentRequest>
            <pay:payment>
                <com:reference>ABCD</com:reference>
                <com:source>AB</com:source>
                <com:amount>2323</com:amount>
                <com:motive>PAGO</com:motive>
                <com:idService>1</com:idService>
                <com:idBank>AC</com:idBank>
                <com:destination>CA</com:destination>
                <com:datePayment></com:datePayment>
            </pay:payment>
        </pay:MakePaymentRequest>
    </soapenv:Body>
</soapenv:Envelope>